# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'asciicinema'
brew 'awscli'
brew 'git'
brew 'graphviz' # produces graph diagrams
brew 'hub'
brew 'jq'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

cask 'google-cloud-sdk'

# Devops tools
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'nmap'
brew 'openssl' #cfssl?
brew 'terraform'

cask 'docker'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Apps
cask 'aerial'
cask 'caffeine'
cask 'dropbox'
cask 'franz'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
cask 'quip'
cask 'slack'
cask 'vlc'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

